ConvergingDivergingNozzle/OpenFOAM-2.3.0/nozzle-tet-netgen3D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            pressureInletOutletVelocity;
        phi		phi;
        rho		rho;
        tangentialVelocity uniform (0 0 0);
        value		uniform ( 0 0 0 );
    }

    outlet
    {
        type            zeroGradient;
    }

    #include "emptySymmetry.include"

    vert-outlet
    {
        type            zeroGradient;
    }
    horiz-outlet
    {
        type            zeroGradient;
    }
    left-walls
    {
        type            fixedValue;
        value		uniform (0 0 0);
    }
    nozzle-walls
    {
        type            fixedValue;
        value		uniform (0 0 0);
    }
    defaultFaces
    {
        type            fixedValue;
        value		uniform (0 0 0);
    }
}

// ************************************************************************* //



