ConvergingDivergingNozzle/OpenFOAM-2.3.0/nozzle-tet-netgen3D/0/emptySymmetry.include
    symmetry-bottom
    {
	type		symmetryPlane;
    }
    symmetry-side
    {
	type		slip;
    }




