ConvergingDivergingNozzle/OpenFOAM-2.3.0/nozzle-tet-netgen3D/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    symmetry-bottom
    {
        type            symmetryPlane;
    }
    symmetry-side
    {
        type            slip;
    }
    nozzle-walls
    {
        type            zeroGradient;
    }
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       1e-3;
        value           uniform 0;
    }
    left-walls
    {
        type            zeroGradient;
    }
    horiz-outlet
    {
        type            zeroGradient;
    }
    vert-outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
