ConvergingDivergingNozzle/OpenFOAM-2.3.0/nozzle-tet-netgen3D/0/zeroGradient.include

    vert-outlet
    {
        type            zeroGradient;
    }
    horiz-outlet
    {
        type            zeroGradient;
    }
    left-walls
    {
        type           zeroGradient;
    }
    nozzle-walls
    {
        type            zeroGradient;
    }
    defaultFaces
    {
	type		zeroGradient;
    }

