ConvergingDivergingNozzle/OpenFOAM-2.3.0/nozzle-tet-netgen3D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    symmetry-bottom
    {
        type            symmetryPlane;
        nFaces          36274;
        startFace       10726361;
    }
    symmetry-side
    {
        type            slip;
        nFaces          164834;
        startFace       10762635;
    }
    nozzle-walls
    {
        type            wall;
        nFaces          24070;
        startFace       10927469;
    }
    inlet
    {
        type            patch;
        nFaces          6828;
        startFace       10951539;
    }
    left-walls
    {
        type            wall;
        nFaces          11270;
        startFace       10958367;
    }
    horiz-outlet
    {
        type            patch;
        nFaces          11972;
        startFace       10969637;
    }
    vert-outlet
    {
        type            patch;
        nFaces          10866;
        startFace       10981609;
    }
)

// ************************************************************************* //
