ConvergingDivergingNozzle/OpenFOAM-2.3.0/nozzle-tet-netgen3D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoCentralFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1.0e-2;

deltaT          0.01e-6;

writeControl    adjustableRunTime;

writeInterval   1.0e-4;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression true;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  true;

maxCo           0.5;

maxDeltaT       1e-3;

CourantType	faceCourant;

libs ("libcompressibleTools.so");

// ************************************************************************* //
